Autodesk.Revit.DB.ATFTranslationServiceData.DocumentToTranslate
Gets the document containing the data to be translated.

Autodesk.Revit.DB.ATFTranslationServiceData.ExportOptions
Export options used for translation to STL, OBJ, XML, SAT, or FDXJ file formats, or to FDX data exchange.

Autodesk.Revit.DB.ATFTranslationServiceData.OutputLocation
Gets the output path where the translated document should be saved, or a file URN of an FDX exchange.

Autodesk.Revit.DB.ATFTranslationServiceData
This is a container for data which is passed from Revit to an instance of IATFTranslationServer.